Product/IntegrationTest/JunitIntegrationTests/Adapters/Framework/AdapterFrameworkIntTest/src/test/resources/data/GetDemographicsSOAPRequest.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
	<SOAP-ENV:Body>
		<m:PatientDemographics_PRPA_IN201307UV02Request xmlns:m="urn:hl7-org:v3">
			<m:localDeviceId>1.1</m:localDeviceId>
			<m:senderOID>1.1</m:senderOID>
			<m:receiverOID>1.1</m:receiverOID>
			<m:query>
				<m:id extension="20090920011010.005"/>
				<m:creationTime value="20090920011010.005"/>
				<m:interactionId extension="PRPA_IN201307UV02"/>
				<m:processingCode/>
				<m:processingModeCode/>
				<m:acceptAckCode/>
				<!-- Receiving Application and Receiving Facility. i.e. application = Adapter Assembly Service, Facility = OID -->
				<m:receiver typeCode="RCV">
					<m:device classCode="DEV" determinerCode="INSTANCE">
						<m:id extension="Common Data Layer Service"/>
					</m:device>
				</m:receiver>
				<!-- Sending Application and Sending Facility. i.e. application = Adapter Assembly Service, Facility = OID -->
				<m:sender typeCode="SND">
					<m:device classCode="DEV" determinerCode="INSTANCE">
						<m:id extension="Adapter Assembly Service"/>
					</m:device>
				</m:sender>
				<m:controlActProcess classCode="CACT" moodCode="EVN">
					<m:code code="PRPA_TE201307UV02"/>
					<m:priorityCode code="R"/>
					<m:queryByParameter>
						<m:queryId extension="20090920010010" root="2.16.840.1.113883.3.198"/>
						<m:statusCode code="new"/>
						<m:responsePriorityCode code="I"/>
						<m:parameterList>
							<m:patientIdentifier>
								<m:value extension="8237363"/>
								<m:semanticsText/>
							</m:patientIdentifier>
						</m:parameterList>
					</m:queryByParameter>
				</m:controlActProcess>
			</m:query>
		</m:PatientDemographics_PRPA_IN201307UV02Request>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
